Documents/УведомлениеОЗачислении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>УведомлениеОЗачислении</Name>
			<BasedOn>
				<xr:Item>Catalog.Обучающиеся</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриказОЗачислении</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДвижениеОбучающихся</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассЗачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассныйРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УведомлениеОЗачислении/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УведомлениеОЗачислении.Номер КАК Номер,
	|	УведомлениеОЗачислении.Дата КАК Дата,
	|	УведомлениеОЗачислении.Обучающийся КАК Обучающийся,
	|	УведомлениеОЗачислении.Класс КАК Класс,
	|	УведомлениеОЗачислении.ПриказОЗачислении КАК ПриказОЗачислении,
	|	УведомлениеОЗачислении.КлассныйРуководитель КАК КлассныйРуководитель
	|ИЗ
	|	Документ.УведомлениеОЗачислении КАК УведомлениеОЗачислении
	|ГДЕ
	|	УведомлениеОЗачислении.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКонстанта = Новый Запрос("Выбрать Константы.РуководительОрганизации Как Объект Из Константы");
	Руководитель = ЗапросКонстанта.Выполнить().Выбрать();
	Если Не Руководитель.Следующий() Тогда
		Сообщить("Ошибка: Не удалось получить данные о руководителе организации");
		Возврат;
    КонецЕсли;
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ВыводУведомлениеОЗачисление(Выборка,ТабДок,Руководитель.Объект);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
